In [2]:
import sqlite3

In [4]:
#connet to an sqlite db
connection=sqlite3.connect("example.db")
connection

In [6]:
cursor=connection.cursor()

In [8]:
#create a table
cursor.execute("""
    create Table If Not EXists employees(
        id Integer Primary Key,
        name Text Not Null,
        age Integer,
        department Text
        )
    """)
##commit the changes
connection.commit()

In [11]:
cursor.execute('''
               Select * from employees
               ''')

In [15]:
#insert the data in table
cursor.execute("""
               insert into employees(name,age,department)
                values("Nishant", "22", "Engineering")
    """)
connection.commit()

In [17]:
cursor.execute(
    """select * from employees"""
)
rows=cursor.fetchall()
#print the data
for row in rows:
    print(row)

(1, 'Nishant', 22, 'Engineering')
(2, 'Nishant', 22, 'Engineering')

In [22]:
#update the data
cursor.execute(
    """ update employees
    set age=25 where name="Nishant"
    """
)
connection.commit()

In [25]:
cursor.execute(
    """select * from employees"""
)
rows=cursor.fetchall()
for row in rows:
    print(row)

(1, 'Nishant', 25, 'Engineering')
(2, 'Nishant', 25, 'Engineering')

In [27]:
#delete the data
cursor.execute(
    """Delete from employees where name='Nishant' """
)
connection.commit()

In [30]:
cursor.execute(
    """select * from employees"""
)
rows=cursor.fetchall()
for row in rows:
    print(row)

In [63]:
#working with sales data
connections= sqlite3.connect("sales.db")
cursor = connections.cursor()

cursor.execute("""
    CREATE TABLE sales (
        id INTEGER PRIMARY KEY,
        date TEXT NOT NULL,
        product TEXT NOT NULL,
        sales INTEGER,
        region TEXT
    )
""")

sales = [
    (1, '1/1', 'prod1', 100, "north"),
    (2, '1/2', 'prod2', 200, "east"),
    (3, '1/3', 'prod3', 300, "south"),
    (4, '1/4', 'prod4', 400, "south"),
    (5, '1/5', 'prod5', 500, "west"),
]

cursor.executemany(
    "INSERT INTO sales (id, date, product, sales, region) VALUES (?, ?, ?, ?, ?)",
    sales
)
connections.commit()

OperationalError: table sales already exists

In [65]:
cursor.execute("select * from sales")
rows=cursor.fetchall()
for row in rows:
    print(row)

(1, '1/1', 'prod1', 100, 'north')
(2, '1/2', 'prod2', 200, 'east')
(3, '1/3', 'prod3', 300, 'south')
(4, '1/4', 'prod4', 400, 'south')
(5, '1/5', 'prod5', 500, 'west')

In [66]:
#close the connection
connection.close()